# =========================
# 共通
# =========================
SCREEN_SIZE = (1000, 660)
FPS = 60

# =========================
# ゲーム
# =========================
GAME_SCREEN_OFFSET = (320, 0) # ゲームフィールドのオフセット
BOARD_GRID_NUM = (12, 23)     # ボードのマスの数
GAME_GRID_NUM = (10, 21)      # ゲームボードのマスの数
START_MINO_GRID = (4, 0)      # ミノの出現位置（左上のマス）
BLOCK_SIZE = (30, 30)         # ブロックサイズ
READY_FRAME = 60.0            # ゲーム開始までのフレーム
DEFAULT_FALL_SPEED = 48       # 何フレーム間隔で降下するか
FALL_HIGH_SPEED = 1           # 何フレーム間隔で降下するか（降下キー押下時）
LEVEL_UP_COUNT = 10           # 何段ミノを消したらレベルが上がるか
CLEAR_LINE_ANIM_SPEED = 16    # ライン消し演出速度
SPEED_UP_INTERVAL = 1         # レベルアップ時の速度上昇量
GAME_OVER_GRID_Y = 2          # ゲームオーバー判定縦マス数
NEXT_MINO_MAX = 6             # 予告ミノの最大数

GAME_BG_COLOR = "#111111"               # ゲーム背景の色
GAME_BG_LIMIT_LINE_COLOR = "#FFFFFF"    # リミットラインの色
GAME_BG_FRAME_LINE_COLOR = "#0000B4"    # フレームラインの色
GAME_BG_LIMIT_LINE_WIDTH = 1            # リミットラインの幅
GAME_BG_FRAME_LINE_WIDTH = 2            # フレームラインの幅

NEXT_MINO_SIZE = 10.0                   # 予告ミノのサイズ
NEXT_MINO_INV_Y = 40.0                  # 予告ミノの縦間隔
NEXT_MINO_LINE_LENGTH_X = 94.0          # 予告ミノの表示エリアの横幅
NEXT_MINO_TEXT_COLOR = "#FFFFFF"        # 予告ミノの「NEXT」テキスト色
NEXT_MINO_TEXT_BG_COLOR = "#0000A0"     # 予告ミノの「NEXT」テキスト背景の色
NEXT_MINO_TEXT_AREA_Y = 32.0            # 予告ミノの「NEXT」表示エリアの縦幅

USER_GUIDE_FONT_SIZE = 20               # 操作説明文のテキストサイズ
USER_GUIDE_FONT_INV = 30                # 操作説明文の縦間隔
USER_GUIDE_TEXT_COLOR = "#FFFFFF"       # 操作説明文のテキスト色
USER_GUIDE_OFFSET = (200.0, 420.0)      # 操作説明文のテキスト位置
USER_GUIDE_TEXT = [                     # 操作説明文
    "A : 左移動",
    "S : 下移動",
    "D : 右移動",
    "P : 一時停止",
    "→ : 右回転",
    "← : 左回転"
]

# -------------------------
# ミノの設定
# -------------------------
GHOST_MINO_ALPHA = "40" # ゴーストミノのα値

# ミノの色
MINO_COLOR_STR = (
    "#000000",  # None
    "#87cefa",  # I 水
    "#ffff00",  # O 黄
    "#7cfc00",  # S 緑
    "#dc143c",  # Z 赤
    "#0000cd",  # J 青
    "#ffa500",  # L オレンジ
    "#9932cc"   # T 紫
)

# I-ミノ
MINO_I_MATRIX = [
                    [[0], [0], [0], [0]],
                    [[1], [1], [1], [1]],
                    [[0], [0], [0], [0]],
                    [[0], [0], [0], [0]]
                ],\
                [
                    [[0], [0], [1], [0]],
                    [[0], [0], [1], [0]],
                    [[0], [0], [1], [0]],
                    [[0], [0], [1], [0]]
                ],\
                [
                    [[0], [0], [0], [0]],
                    [[0], [0], [0], [0]],
                    [[1], [1], [1], [1]],
                    [[0], [0], [0], [0]]
                ],\
                [
                    [[0], [1], [0], [0]],
                    [[0], [1], [0], [0]],
                    [[0], [1], [0], [0]],
                    [[0], [1], [0], [0]]
                ]
# O-ミノ
MINO_O_MATRIX = [
                    [[0], [0], [0], [0]],
                    [[0], [1], [1], [0]],
                    [[0], [1], [1], [0]],
                    [[0], [0], [0], [0]]
                ],\
                [
                    [[0], [0], [0], [0]],
                    [[0], [1], [1], [0]],
                    [[0], [1], [1], [0]],
                    [[0], [0], [0], [0]]
                ]
# S-ミノ
MINO_S_MATRIX = [
                    [[0], [0], [0]],
                    [[0], [1], [1]],
                    [[1], [1], [0]]
                ],\
                [
                    [[1], [0], [0]],
                    [[1], [1], [0]],
                    [[0], [1], [0]]
                ],\
                [
                    [[0], [1], [1]],
                    [[1], [1], [0]],
                    [[0], [0], [0]]
                ],\
                [
                    [[0], [1], [0]],
                    [[0], [1], [1]],
                    [[0], [0], [1]]
                ]
# Z-ミノ
MINO_Z_MATRIX = [
                    [[0], [0], [0]],
                    [[1], [1], [0]],
                    [[0], [1], [1]]
                ],\
                [
                    [[0], [1], [0]],
                    [[1], [1], [0]],
                    [[1], [0], [0]]
                ],\
                [
                    [[1], [1], [0]],
                    [[0], [1], [1]],
                    [[0], [0], [0]]
                ],\
                [
                    [[0], [0], [1]],
                    [[0], [1], [1]],
                    [[0], [1], [0]]
                ]
# J-ミノ
MINO_J_MATRIX = [   
                    [[0], [0], [0]],
                    [[1], [0], [0]],
                    [[1], [1], [1]],
                    [[0], [0], [0]]
                ],\
                [
                    [[0], [0], [0]],
                    [[0], [1], [1]],
                    [[0], [1], [0]],
                    [[0], [1], [0]]
                ],\
                [
                    [[0], [0], [0]],
                    [[0], [0], [0]],
                    [[1], [1], [1]],
                    [[0], [0], [1]]
                ],\
                [
                    [[0], [0], [0]],
                    [[0], [1], [0]],
                    [[0], [1], [0]],
                    [[1], [1], [0]]
                ]
# L-ミノ
MINO_L_MATRIX = [
                    [[0], [0], [0]],
                    [[1], [1], [1]],
                    [[1], [0], [0]]
                ],\
                [
                    [[1], [1], [0]],
                    [[0], [1], [0]],
                    [[0], [1], [0]]
                ],\
                [
                    [[0], [0], [1]],
                    [[1], [1], [1]],
                    [[0], [0], [0]]
                ],\
                [
                    [[0], [1], [0]],
                    [[0], [1], [0]],
                    [[0], [1], [1]]
                ]
# T-ミノ
MINO_T_MATRIX = [   [[0], [0], [0]],
                    [[0], [1], [0]],
                    [[1], [1], [1]],
                    [[0], [0], [0]]
                ],\
                [
                    [[0], [0], [0]],
                    [[0], [1], [0]],
                    [[0], [1], [1]],
                    [[0], [1], [0]]
                ],\
                [
                    [[0], [0], [0]],
                    [[0], [0], [0]],
                    [[1], [1], [1]],
                    [[0], [1], [0]]
                ],\
                [
                    [[0], [0], [0]],
                    [[0], [1], [0]],
                    [[1], [1], [0]],
                    [[0], [1], [0]]
                ]
